ApacheBench Test Results&Report/myproxy100k.txt
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        BaseHTTP/0.6
Server Hostname:        127.0.0.1
Server Port:            8080

Document Path:          /3000
Document Length:        3000 bytes

Concurrency Level:      1
Time taken for tests:   0.578 seconds
Complete requests:      100
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      313600 bytes
HTML transferred:       300000 bytes
Requests per second:    173.15 [#/sec] (mean)
Time per request:       5.775 [ms] (mean)
Time per request:       5.775 [ms] (mean, across all concurrent requests)
Transfer rate:          530.27 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.7      0       6
Processing:     0    6   4.6      5      22
Waiting:        0    5   4.3      5      20
Total:          0    6   4.5      6      22

Percentage of the requests served within a certain time (ms)
  50%      6
  66%      8
  75%      8
  80%      9
  90%     11
  95%     13
  98%     20
  99%     22
 100%     22 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        BaseHTTP/0.6
Server Hostname:        127.0.0.1
Server Port:            8080

Document Path:          /3000
Document Length:        3000 bytes

Concurrency Level:      2
Time taken for tests:   0.559 seconds
Complete requests:      100
Failed requests:        6
   (Connect: 0, Receive: 0, Length: 6, Exceptions: 0)
Keep-Alive requests:    0
Total transferred:      295600 bytes
HTML transferred:       282000 bytes
Requests per second:    178.85 [#/sec] (mean)
Time per request:       11.183 [ms] (mean)
Time per request:       5.591 [ms] (mean, across all concurrent requests)
Transfer rate:          516.29 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.7      0       7
Processing:     1   11   5.4     10      37
Waiting:        1   10   4.9     10      30
Total:          1   11   5.5     10      37

Percentage of the requests served within a certain time (ms)
  50%     10
  66%     11
  75%     13
  80%     14
  90%     19
  95%     20
  98%     30
  99%     37
 100%     37 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        BaseHTTP/0.6
Server Hostname:        127.0.0.1
Server Port:            8080

Document Path:          /3000
Document Length:        3000 bytes

Concurrency Level:      3
Time taken for tests:   0.474 seconds
Complete requests:      100
Failed requests:        19
   (Connect: 0, Receive: 0, Length: 19, Exceptions: 0)
Keep-Alive requests:    0
Total transferred:      256600 bytes
HTML transferred:       243000 bytes
Requests per second:    210.90 [#/sec] (mean)
Time per request:       14.225 [ms] (mean)
Time per request:       4.742 [ms] (mean, across all concurrent requests)
Transfer rate:          528.49 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.3      0       2
Processing:     3   14   5.7     13      31
Waiting:        3   13   5.3     12      31
Total:          3   14   5.7     13      31

Percentage of the requests served within a certain time (ms)
  50%     13
  66%     17
  75%     20
  80%     20
  90%     20
  95%     22
  98%     29
  99%     31
 100%     31 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        BaseHTTP/0.6
Server Hostname:        127.0.0.1
Server Port:            8080

Document Path:          /3000
Document Length:        3000 bytes

Concurrency Level:      4
Time taken for tests:   0.413 seconds
Complete requests:      100
Failed requests:        11
   (Connect: 0, Receive: 0, Length: 11, Exceptions: 0)
Keep-Alive requests:    0
Total transferred:      280600 bytes
HTML transferred:       267000 bytes
Requests per second:    241.84 [#/sec] (mean)
Time per request:       16.540 [ms] (mean)
Time per request:       4.135 [ms] (mean, across all concurrent requests)
Transfer rate:          662.70 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.1      0       7
Processing:     3   16   5.7     16      31
Waiting:        3   14   5.3     14      27
Total:          3   16   5.8     16      31

Percentage of the requests served within a certain time (ms)
  50%     16
  66%     19
  75%     20
  80%     20
  90%     24
  95%     27
  98%     31
  99%     31
 100%     31 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        BaseHTTP/0.6
Server Hostname:        127.0.0.1
Server Port:            8080

Document Path:          /3000
Document Length:        3000 bytes

Concurrency Level:      5
Time taken for tests:   0.401 seconds
Complete requests:      100
Failed requests:        16
   (Connect: 0, Receive: 0, Length: 16, Exceptions: 0)
Keep-Alive requests:    0
Total transferred:      265600 bytes
HTML transferred:       252000 bytes
Requests per second:    249.12 [#/sec] (mean)
Time per request:       20.071 [ms] (mean)
Time per request:       4.014 [ms] (mean, across all concurrent requests)
Transfer rate:          646.16 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.4      0       2
Processing:     7   19   6.7     19      39
Waiting:        7   18   6.4     17      37
Total:          8   19   6.8     19      40

Percentage of the requests served within a certain time (ms)
  50%     19
  66%     21
  75%     23
  80%     25
  90%     28
  95%     32
  98%     36
  99%     40
 100%     40 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        BaseHTTP/0.6
Server Hostname:        127.0.0.1
Server Port:            8080

Document Path:          /3000
Document Length:        3000 bytes

Concurrency Level:      6
Time taken for tests:   0.372 seconds
Complete requests:      100
Failed requests:        19
   (Connect: 0, Receive: 0, Length: 19, Exceptions: 0)
Keep-Alive requests:    0
Total transferred:      256600 bytes
HTML transferred:       243000 bytes
Requests per second:    268.97 [#/sec] (mean)
Time per request:       22.307 [ms] (mean)
Time per request:       3.718 [ms] (mean, across all concurrent requests)
Transfer rate:          674.01 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.0      0       8
Processing:    10   21   7.2     21      38
Waiting:        9   20   7.1     20      34
Total:         10   22   7.2     21      38

Percentage of the requests served within a certain time (ms)
  50%     21
  66%     23
  75%     29
  80%     30
  90%     31
  95%     33
  98%     35
  99%     38
 100%     38 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        BaseHTTP/0.6
Server Hostname:        127.0.0.1
Server Port:            8080

Document Path:          /3000
Document Length:        3000 bytes

Concurrency Level:      7
Time taken for tests:   0.398 seconds
Complete requests:      100
Failed requests:        19
   (Connect: 0, Receive: 0, Length: 19, Exceptions: 0)
Keep-Alive requests:    0
Total transferred:      256600 bytes
HTML transferred:       243000 bytes
Requests per second:    251.04 [#/sec] (mean)
Time per request:       27.884 [ms] (mean)
Time per request:       3.983 [ms] (mean, across all concurrent requests)
Transfer rate:          629.07 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.9      0       7
Processing:     9   26   8.1     28      50
Waiting:        9   24   8.1     23      47
Total:          9   26   8.0     28      50

Percentage of the requests served within a certain time (ms)
  50%     28
  66%     30
  75%     30
  80%     31
  90%     38
  95%     41
  98%     47
  99%     50
 100%     50 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        BaseHTTP/0.6
Server Hostname:        127.0.0.1
Server Port:            8080

Document Path:          /3000
Document Length:        3000 bytes

Concurrency Level:      8
Time taken for tests:   8.273 seconds
Complete requests:      100
Failed requests:        10
   (Connect: 0, Receive: 0, Length: 10, Exceptions: 0)
Keep-Alive requests:    0
Total transferred:      283600 bytes
HTML transferred:       270000 bytes
Requests per second:    12.09 [#/sec] (mean)
Time per request:       661.801 [ms] (mean)
Time per request:       82.725 [ms] (mean, across all concurrent requests)
Transfer rate:          33.48 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   82 189.9      0     520
Processing:     3  578 209.9    520    1040
Waiting:        3  500  87.5    520     520
Total:         13  660 253.7    520    1040

Percentage of the requests served within a certain time (ms)
  50%    520
  66%    520
  75%   1020
  80%   1030
  90%   1038
  95%   1040
  98%   1040
  99%   1040
 100%   1040 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        BaseHTTP/0.6
Server Hostname:        127.0.0.1
Server Port:            8080

Document Path:          /3000
Document Length:        3000 bytes

Concurrency Level:      9
Time taken for tests:   8.280 seconds
Complete requests:      100
Failed requests:        14
   (Connect: 0, Receive: 0, Length: 14, Exceptions: 0)
Keep-Alive requests:    0
Total transferred:      271600 bytes
HTML transferred:       258000 bytes
Requests per second:    12.08 [#/sec] (mean)
Time per request:       745.203 [ms] (mean)
Time per request:       82.800 [ms] (mean, across all concurrent requests)
Transfer rate:          32.03 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   82 189.7      0     520
Processing:    10  650 269.0    520    1040
Waiting:       10  490 110.2    515     521
Total:         10  732 284.1    521    1040

Percentage of the requests served within a certain time (ms)
  50%    521
  66%   1025
  75%   1030
  80%   1030
  90%   1031
  95%   1040
  98%   1040
  99%   1040
 100%   1040 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        BaseHTTP/0.6
Server Hostname:        127.0.0.1
Server Port:            8080

Document Path:          /3000
Document Length:        3000 bytes

Concurrency Level:      10
Time taken for tests:   8.242 seconds
Complete requests:      100
Failed requests:        5
   (Connect: 0, Receive: 0, Length: 5, Exceptions: 0)
Keep-Alive requests:    0
Total transferred:      298600 bytes
HTML transferred:       285000 bytes
Requests per second:    12.13 [#/sec] (mean)
Time per request:       824.243 [ms] (mean)
Time per request:       82.424 [ms] (mean, across all concurrent requests)
Transfer rate:          35.38 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   82 189.4      0     520
Processing:     5  731 284.2    520    1040
Waiting:        0  494 100.3    511     520
Total:          5  813 274.8   1020    1040

Percentage of the requests served within a certain time (ms)
  50%   1020
  66%   1027
  75%   1030
  80%   1030
  90%   1040
  95%   1040
  98%   1040
  99%   1040
 100%   1040 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        BaseHTTP/0.6
Server Hostname:        127.0.0.1
Server Port:            8080

Document Path:          /3000
Document Length:        3000 bytes

Concurrency Level:      11
Time taken for tests:   8.273 seconds
Complete requests:      100
Failed requests:        17
   (Connect: 0, Receive: 0, Length: 17, Exceptions: 0)
Keep-Alive requests:    0
Total transferred:      262600 bytes
HTML transferred:       249000 bytes
Requests per second:    12.09 [#/sec] (mean)
Time per request:       910.019 [ms] (mean)
Time per request:       82.729 [ms] (mean, across all concurrent requests)
Transfer rate:          31.00 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   82 189.9      0     523
Processing:    10  810 285.2   1025    1043
Waiting:       10  495  99.6    520     523
Total:         10  892 251.2   1030    1043

Percentage of the requests served within a certain time (ms)
  50%   1030
  66%   1030
  75%   1034
  80%   1040
  90%   1040
  95%   1043
  98%   1043
  99%   1043
 100%   1043 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        BaseHTTP/0.6
Server Hostname:        127.0.0.1
Server Port:            8080

Document Path:          /3000
Document Length:        3000 bytes

Concurrency Level:      12
Time taken for tests:   8.272 seconds
Complete requests:      100
Failed requests:        8
   (Connect: 0, Receive: 0, Length: 8, Exceptions: 0)
Keep-Alive requests:    0
Total transferred:      289600 bytes
HTML transferred:       276000 bytes
Requests per second:    12.09 [#/sec] (mean)
Time per request:       992.672 [ms] (mean)
Time per request:       82.723 [ms] (mean, across all concurrent requests)
Transfer rate:          34.19 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   82 189.8      0     520
Processing:    12  887 255.4   1030    1040
Waiting:        8  500  86.6    519     520
Total:         12  970 185.5   1030    1040

Percentage of the requests served within a certain time (ms)
  50%   1030
  66%   1035
  75%   1035
  80%   1039
  90%   1040
  95%   1040
  98%   1040
  99%   1040
 100%   1040 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        BaseHTTP/0.6
Server Hostname:        127.0.0.1
Server Port:            8080

Document Path:          /3000
Document Length:        3000 bytes

Concurrency Level:      13
Time taken for tests:   8.270 seconds
Complete requests:      100
Failed requests:        17
   (Connect: 0, Receive: 0, Length: 17, Exceptions: 0)
Keep-Alive requests:    0
Total transferred:      262600 bytes
HTML transferred:       249000 bytes
Requests per second:    12.09 [#/sec] (mean)
Time per request:       1075.129 [ms] (mean)
Time per request:       82.702 [ms] (mean, across all concurrent requests)
Transfer rate:          31.01 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   82 189.9      0     520
Processing:     3  965 215.7   1030    1040
Waiting:        3  712 291.4    520    1040
Total:          3 1047 279.1   1031    1560

Percentage of the requests served within a certain time (ms)
  50%   1031
  66%   1040
  75%   1040
  80%   1040
  90%   1550
  95%   1550
  98%   1560
  99%   1560
 100%   1560 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        BaseHTTP/0.6
Server Hostname:        127.0.0.1
Server Port:            8080

Document Path:          /3000
Document Length:        3000 bytes

Concurrency Level:      14
Time taken for tests:   8.260 seconds
Complete requests:      100
Failed requests:        6
   (Connect: 0, Receive: 0, Length: 6, Exceptions: 0)
Keep-Alive requests:    0
Total transferred:      295600 bytes
HTML transferred:       282000 bytes
Requests per second:    12.11 [#/sec] (mean)
Time per request:       1156.403 [ms] (mean)
Time per request:       82.600 [ms] (mean, across all concurrent requests)
Transfer rate:          34.95 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   82 189.7      0     520
Processing:     5 1040 290.9   1030    1550
Waiting:        5  741 295.5    520    1040
Total:          5 1122 320.5   1030    1550

Percentage of the requests served within a certain time (ms)
  50%   1030
  66%   1040
  75%   1535
  80%   1540
  90%   1550
  95%   1550
  98%   1550
  99%   1550
 100%   1550 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        BaseHTTP/0.6
Server Hostname:        127.0.0.1
Server Port:            8080

Document Path:          /3000
Document Length:        3000 bytes

Concurrency Level:      15
Time taken for tests:   8.277 seconds
Complete requests:      100
Failed requests:        14
   (Connect: 0, Receive: 0, Length: 14, Exceptions: 0)
Keep-Alive requests:    0
Total transferred:      271600 bytes
HTML transferred:       258000 bytes
Requests per second:    12.08 [#/sec] (mean)
Time per request:       1241.607 [ms] (mean)
Time per request:       82.774 [ms] (mean, across all concurrent requests)
Transfer rate:          32.04 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   82 189.9      0     522
Processing:    10 1114 341.2   1040    1562
Waiting:        3  742 295.1    520    1042
Total:         10 1197 350.5   1040    1562

Percentage of the requests served within a certain time (ms)
  50%   1040
  66%   1540
  75%   1545
  80%   1550
  90%   1560
  95%   1560
  98%   1562
  99%   1562
 100%   1562 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        BaseHTTP/0.6
Server Hostname:        127.0.0.1
Server Port:            8080

Document Path:          /3000
Document Length:        3000 bytes

Concurrency Level:      20
Time taken for tests:   8.259 seconds
Complete requests:      100
Failed requests:        11
   (Connect: 0, Receive: 0, Length: 11, Exceptions: 0)
Keep-Alive requests:    0
Total transferred:      280600 bytes
HTML transferred:       267000 bytes
Requests per second:    12.11 [#/sec] (mean)
Time per request:       1651.749 [ms] (mean)
Time per request:       82.587 [ms] (mean, across all concurrent requests)
Transfer rate:          33.18 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   82 189.7      0     520
Processing:     3 1484 400.9   1547    2070
Waiting:        3  937 429.2   1020    1560
Total:         12 1566 418.0   1550    2070

Percentage of the requests served within a certain time (ms)
  50%   1550
  66%   1560
  75%   2040
  80%   2053
  90%   2067
  95%   2070
  98%   2070
  99%   2070
 100%   2070 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        BaseHTTP/0.6
Server Hostname:        127.0.0.1
Server Port:            8080

Document Path:          /3000
Document Length:        3000 bytes

Concurrency Level:      30
Time taken for tests:   8.273 seconds
Complete requests:      100
Failed requests:        10
   (Connect: 0, Receive: 0, Length: 10, Exceptions: 0)
Keep-Alive requests:    0
Total transferred:      283600 bytes
HTML transferred:       270000 bytes
Requests per second:    12.09 [#/sec] (mean)
Time per request:       2481.821 [ms] (mean)
Time per request:       82.727 [ms] (mean, across all concurrent requests)
Transfer rate:          33.48 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   83 190.1      0     520
Processing:     3 2127 679.4   2570    2600
Waiting:        3 1247 613.6   1042    2080
Total:          3 2210 658.8   2580    2600

Percentage of the requests served within a certain time (ms)
  50%   2580
  66%   2580
  75%   2587
  80%   2590
  90%   2600
  95%   2600
  98%   2600
  99%   2600
 100%   2600 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        BaseHTTP/0.6
Server Hostname:        127.0.0.1
Server Port:            8080

Document Path:          /3000
Document Length:        3000 bytes

Concurrency Level:      40
Time taken for tests:   8.261 seconds
Complete requests:      100
Failed requests:        18
   (Connect: 0, Receive: 0, Length: 18, Exceptions: 0)
Keep-Alive requests:    0
Total transferred:      259600 bytes
HTML transferred:       246000 bytes
Requests per second:    12.11 [#/sec] (mean)
Time per request:       3304.356 [ms] (mean)
Time per request:       82.609 [ms] (mean, across all concurrent requests)
Transfer rate:          30.69 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   82 189.6      0     520
Processing:    10 2688 1046.4   3090    3612
Waiting:        5 1607 895.2   1540    3096
Total:         10 2770 1042.0   3096    3612

Percentage of the requests served within a certain time (ms)
  50%   3096
  66%   3600
  75%   3606
  80%   3610
  90%   3610
  95%   3610
  98%   3612
  99%   3612
 100%   3612 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        BaseHTTP/0.6
Server Hostname:        127.0.0.1
Server Port:            8080

Document Path:          /3000
Document Length:        3000 bytes

Concurrency Level:      50
Time taken for tests:   8.280 seconds
Complete requests:      100
Failed requests:        7
   (Connect: 0, Receive: 0, Length: 7, Exceptions: 0)
Keep-Alive requests:    0
Total transferred:      292600 bytes
HTML transferred:       279000 bytes
Requests per second:    12.08 [#/sec] (mean)
Time per request:       4139.809 [ms] (mean)
Time per request:       82.796 [ms] (mean, across all concurrent requests)
Transfer rate:          34.51 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   82 189.9      0     520
Processing:     3 3184 1373.5   4130    4670
Waiting:        3 2234 1247.0   2080    4130
Total:         13 3266 1373.7   4130    4670

Percentage of the requests served within a certain time (ms)
  50%   4130
  66%   4130
  75%   4142
  80%   4160
  90%   4650
  95%   4651
  98%   4670
  99%   4670
 100%   4670 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        BaseHTTP/0.6
Server Hostname:        127.0.0.1
Server Port:            8080

Document Path:          /3000
Document Length:        3000 bytes

Concurrency Level:      60
Time taken for tests:   8.300 seconds
Complete requests:      100
Failed requests:        7
   (Connect: 0, Receive: 0, Length: 7, Exceptions: 0)
Keep-Alive requests:    0
Total transferred:      292600 bytes
HTML transferred:       279000 bytes
Requests per second:    12.05 [#/sec] (mean)
Time per request:       4980.181 [ms] (mean)
Time per request:       83.003 [ms] (mean, across all concurrent requests)
Transfer rate:          34.43 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   83 190.6      0     520
Processing:     8 3590 1707.7   4150    5200
Waiting:        0 2271 1308.9   2080    4658
Total:         13 3673 1699.7   4658    5200

Percentage of the requests served within a certain time (ms)
  50%   4658
  66%   5180
  75%   5190
  80%   5197
  90%   5200
  95%   5200
  98%   5200
  99%   5200
 100%   5200 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        BaseHTTP/0.6
Server Hostname:        127.0.0.1
Server Port:            8080

Document Path:          /3000
Document Length:        3000 bytes

Concurrency Level:      70
Time taken for tests:   8.263 seconds
Complete requests:      100
Failed requests:        14
   (Connect: 0, Receive: 0, Length: 14, Exceptions: 0)
Keep-Alive requests:    0
Total transferred:      271600 bytes
HTML transferred:       258000 bytes
Requests per second:    12.10 [#/sec] (mean)
Time per request:       5784.057 [ms] (mean)
Time per request:       82.629 [ms] (mean, across all concurrent requests)
Transfer rate:          32.10 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   82 189.4      0     520
Processing:     8 3871 1994.5   4120    6190
Waiting:        8 2506 1642.5   2079    5670
Total:          8 3953 1989.8   4639    6190

Percentage of the requests served within a certain time (ms)
  50%   4639
  66%   5667
  75%   5670
  80%   6170
  90%   6180
  95%   6190
  98%   6190
  99%   6190
 100%   6190 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        BaseHTTP/0.6
Server Hostname:        127.0.0.1
Server Port:            8080

Document Path:          /3000
Document Length:        3000 bytes

Concurrency Level:      80
Time taken for tests:   8.287 seconds
Complete requests:      100
Failed requests:        20
   (Connect: 0, Receive: 0, Length: 20, Exceptions: 0)
Keep-Alive requests:    0
Total transferred:      253600 bytes
HTML transferred:       240000 bytes
Requests per second:    12.07 [#/sec] (mean)
Time per request:       6629.778 [ms] (mean)
Time per request:       82.872 [ms] (mean, across all concurrent requests)
Transfer rate:          29.88 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   83 190.1      0     520
Processing:    10 4176 2206.0   4657    7220
Waiting:        5 2783 1865.0   2080    6182
Total:         10 4258 2199.0   4657    7220

Percentage of the requests served within a certain time (ms)
  50%   4657
  66%   5680
  75%   6697
  80%   6700
  90%   6700
  95%   7217
  98%   7220
  99%   7220
 100%   7220 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        BaseHTTP/0.6
Server Hostname:        127.0.0.1
Server Port:            8080

Document Path:          /3000
Document Length:        3000 bytes

Concurrency Level:      90
Time taken for tests:   8.290 seconds
Complete requests:      100
Failed requests:        9
   (Connect: 0, Receive: 0, Length: 9, Exceptions: 0)
Keep-Alive requests:    0
Total transferred:      286600 bytes
HTML transferred:       273000 bytes
Requests per second:    12.06 [#/sec] (mean)
Time per request:       7461.307 [ms] (mean)
Time per request:       82.903 [ms] (mean, across all concurrent requests)
Transfer rate:          33.76 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   83 190.3      0     520
Processing:    13 4244 2418.6   4120    7750
Waiting:       10 3350 2276.9   3092    7240
Total:         13 4327 2412.3   4640    7750

Percentage of the requests served within a certain time (ms)
  50%   4640
  66%   5680
  75%   6710
  80%   7230
  90%   7748
  95%   7750
  98%   7750
  99%   7750
 100%   7750 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        BaseHTTP/0.6
Server Hostname:        127.0.0.1
Server Port:            8080

Document Path:          /3000
Document Length:        3000 bytes

Concurrency Level:      100
Time taken for tests:   8.260 seconds
Complete requests:      100
Failed requests:        14
   (Connect: 0, Receive: 0, Length: 14, Exceptions: 0)
Keep-Alive requests:    0
Total transferred:      271600 bytes
HTML transferred:       258000 bytes
Requests per second:    12.11 [#/sec] (mean)
Time per request:       8259.521 [ms] (mean)
Time per request:       82.595 [ms] (mean, across all concurrent requests)
Transfer rate:          32.11 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   82 189.6      0     520
Processing:    12 4296 2486.3   4132    8247
Waiting:        0 4212 2491.4   4130    8247
Total:         12 4379 2479.3   4642    8247

Percentage of the requests served within a certain time (ms)
  50%   4642
  66%   5683
  75%   6712
  80%   7220
  90%   7730
  95%   8237
  98%   8247
  99%   8247
 100%   8247 (longest request)